In [1]:
import pandas as pd

In [12]:
data = {'names':["Erick", "Shad", "James", "Mark"],
        'age': [20, 21, 22, 20],
        'city':["Nairobi", "Nakuru", "Kisumu", "Migori"]}

In [13]:
new_data = pd.DataFrame(data)
new_data

   names  age     city
0  Erick   20  Nairobi
1   Shad   21   Nakuru
2  James   22   Kisumu
3   Mark   20   Migori